{
  "home": "HOME",
  "about": "ABOUT PROJECT",
  "goals": "Goals",
  "methodology": "Methodology",
  "workpackages": "Work Packages",
  "team": "Team",
  "results": "RESULTS",
  "publications": "Publications",
  "presentations": "Presentations",
  "video": "Video",
  "reported_results": "Reported Results",
  "news": "NEWS",
  "surveys": "Online Surveys",
  "seminars": "Seminars",
  "conferences": "Conferences",
  "events": "Other Events",
  "games": "GAMES",
  "contact": "CONTACT",
  "footerContent": {
    "system": "Project management system.",
    "blog": "Blog",
    "project_presentation": "project presentation and Web site",
    "last_modified": "Last update: 15.02.2025",
    "contact": "Contact",
    "phone": "Phone:",
    "email": "Email:",
    "rights_reserved": "All Rights Reserved"
 },
 "homeContent": {
    "title": "Modeling intelligent tools for adaptive and personalized educational STEM video games (MOTIVATE)",
    "personalization": "Personalization",
    "personalization_desc": "Construction, generation and customization of educational video games.",
    "dynamic_adaptation": "Dynamic adaptation",
    "dynamic_adaptation_desc": "Dynamic adaptation of features of created educational video games.",
    "validation": "Validation",
    "validation_desc": "Validation of the methodology and platform for creating intelligent adaptive video games through practical experiments.",
    "related_projects": "Related Projects",
    "goal_title": "Objectives",
    "goal_desc": "The aim of the project is to create a methodology and formal models of intelligent tools using artificial intelligence (AI) for creating adaptive and personalized educational video games and validating them in STEM education, with an analysis of the characteristics of the game process and the success of the learner, by upgrading an existing open software platform for educational video games. The methodology and technological solution (intelligent software tools) for creating and using adaptive and personalized serious video games developed within the project will be validated and evaluated through practical experiments with pedagogy students, secondary school teachers and university lecturers. The validation will include the creation of educational video games in the field of STEM disciplines - both computer and mobile games with augmented reality.",
    "funding": "The MOTIVATE project is funded by the Scientific Research Fund of the Ministry of Education and Science under Contract No. KP06-N85-2 of 05.12.2024.",
    "learn_more": "More information",
    "surveys": "Survey Research",
    "survey_1": "Online survey for learners about educational video games and learning and playing styles",
    "survey_2": "Online survey for learners about the use of educational video games in education",
    "survey_3": "Online survey for teachers about creating educational video games by non-IT specialists and using them in education"
  },
  "goalsContent": {
    "title": "Project objectives",
    "title1": "Objective 1",
    "description1": "To identify formal ways for declarative description of educational game scenarios using semantically structured both game content and didactic tasks;",
    "title2": "Objective 2",
    "description2": "To create a software platform for construction and generation of smart adaptive 3D video maze games consisting of a metadata-driven maze editor and a Unity3D-bazed maze builder (fig. 1) using an adaptation control engine, an intelligent question and answering (Q&A) agent, and declarative game description and semantically structured virtual representation of artifacts;",
    "title3": "Objective 3",
    "description3": "To apply the platform for generation of prototypes of video games about Bulgarian medieval history, using self-created 3D graphic models and game content, pro-active GBL scenarios and didactic tasks, with both simple and smart virtual players supporting the real player as assistants in resolving the tasks;",
    "title4": "Objective 4",
    "description4": "To apply the holistic player-centric model of the ADAPTIMES project for implementing adaptive versions of the online video games by player´s achievements, excitement and emotions, based on behavior tracking and inferring of player´s emotions and attention using analysis of skin conductiveness and of facial expressions;",
    "title5": "Objective 5",
    "description5": "To validate both non-adaptive and adaptive versions of video games through practical online experiments with teachers and students. Experimental studies will use our experience in cultural heritage digitalisation and e-learning projects;",
    "title6": "Objective 6",
    "description6": "To validate both the non-adaptive and adaptive versions of the video games by means of practical online experiments with teachers and school students; the experimental studies will benefit from the proven great experience in project about preservation of cultural heritage and e-learning."
 },
 "methodologyContent": {
    "title": "METHODOLOGY",
    "intro": "The research methodology of MOTIVATE will follow an iterative and incremental approach extending with learning by doing the methodology defined by Kirjavainen especially for generation of game concept and game design and development folliwing a multi-disciplinary prescriptive development model, using an iterative and incremental approach and agile techniques such as the SCRUM process control methodology. As most appropriate for the project as far as it covers all stages of the project research and development process and is combined with learning by doing; with phases as follows:",
    "phase1": "Identification of research problems and formulation of research questions and tasks. Here, learning by doing addresses an increased exchange of scientific and technology solutions ideas between different domain specialists such as cultural heritage specialists, game designers, platform and game developers, and GBL practitioners and pedagogues. Phase objectives: adequate and precise description of the research context (problems in formal game description and semantic content organization, generation of video games, game scenarios/didactic methods/tasks for adaptive games) and detailed research formulation - research questions and tasks, identification of needs of target users of the platform (educationalists and teachers) and of the educational video games constructed by the platform (5-8 class school students).",
    "phase2": "Answering the research questions - by theoretical and practical work with learning by doing.",
    "phase2_goals": "Phase objectives:",
    "phase2.1": "Definition of formal language for description of hierarchical mazes, incl. semantically structured learning content",
    "phase2.2": "Design and development of an innovative open software platform based on an existing game engine (such as Unity 3D ) and used for generation of customized hierarchical 3D video maze games with simple and intelligent virtual players, whereupon the construction is based on declarative game description and semantically structured cultural artifacts, constructed by means of a metadata-driven visual maze editor.",
    "phase3": "Practical proving the answers to the research questions. Phase objectives: implementation of software prototypes of player-centric video games using the generation platform from the previous stage. The iterative and agile (SCRUM-based) risk-driven process will consist of two proof-of-concept iterations, namely:",
    "phase3.1": "Development of non-adaptive prototypes of desktop and online video games for Bulgarian medieval history, with simple virtual players – including proactive game scenarios, tasks and 3D model content authoring. The game-based approach uses modern learning paradigms by developing a series of interconnected activities in which learners are not only active participants but also have the freedom to choose their own learning pathway in the game.",
    "phase3.2": "Development of adaptive prototypes of smart adaptive video games for history education, and questionnaires for online surveys. All the experiments will be conducted online in order to include recognition of player affect inferred EDA and BVP dynamically measured by custom measuring device and the RAGE game asset form measuring the player affect , and recognition of emotions based at least on facial expressions by means of software libraries like Affdex SDK.",
    "phase4": "Practical experiments with the target groups – includes testing of the game prototypes of the chosen domain in real conditions, with online experimental setup including consent form and information sheets, smart adaptive video games for history education with simple and intelligent virtual players, and questionnaires for online surveys. All the experiments will be conducted online in order to include more participants for obtaining statistically significant results. Phase objectives: definition and execution of online experimental studies, including game sessions with non-adaptive and adaptive versions of the games and pre- and post-game questionnaires, addressing previous gaming experience, game engagement and experience , and generation platform usability.",
    "phase5": "Analyses and validation of the results of the study. Phase objectives: analysis and validation of experimental results and their reflection on final games’ prototypes, by means of analysis of variance (ANOVA), correlation analyses, and principal components analysis and/or factor analysis – all applied for validating (1) platform usability for the target user group (teachers and educationalists), (2) learning analytics of adaptive and agent-faciletated GBL for school students, together with (3) expected innovative enhancements of game playability, resulting in guidelines for further research."
  },
  "workpackagesContent": {
    "title": "WORK PACKAGES",
    "wp": "Work package",
    "action": "Activity",
    "expected_result": "Expected results",
    "wp1.1.action": "Comparative analyses in the areas of adaptive, player-centered video games, contemporary use of intelligent agents, platforms for creating video games, and methods and techniques in game-based learning.",
    "wp1.1.result": "Analysis in the areas of adaptive, player-centered video games with intelligent agents for educational purposes and platforms for constructing games and applications for game-based learnin",
    "wp1.2.action": "Identifying the needs of target users of educational video games (teachers and students)",
    "wp1.2.result": "Analysis of needs of target users of educational video games",
    "wp1.3.action": "Identifying the needs of target users of educational video game development platforms (teachers and educators)",
    "wp1.3.result": "Analysis of needs of target users of platforms for construction of educational video games",
    "wp2.1.action": "Declarative modeling of educational maze games with semantic structuring of game and learning content",
    "wp2.1.result": "Declarative model of educational maze games with semantic structuring of game and learning content",
    "wp2.2.action": "Modeling of game process and interaction of players (including virtual ones) in educational video games with one and many players",
    "wp2.2.result": "Model of game process and interaction of players in educational video games",
    "wp2.3.action": "Creating proactive scenarios for game learning and didactic tasks",
    "wp2.3.result": "Proactive scenarios for game learning and didactic tasks",
    "wp3.1.action": "Creating a platform for constructing a video game that automatically generates mazes",
    "wp3.1.result": "Platform for constructing a video game that automatically generates mazes",
    "wp3.2.action": "Creating a metadata-based maze editor with a built-in graphical graph editor and validator",
    "wp3.2.result": "Metadata-based maze editor with a built-in graphical graph editor and validator",
    "wp3.3.action": "Creating an intelligent agent for answering questions based on extracting facts from the content of the domain",
    "wp3.3.result": "Virtual players and an intelligent agent for answering questions",
    "wp4.1.action": "Development of game content, game design and generation",
    "wp4.1.result": "Educational non-adaptive video game-maze about Bulgarian medieval history with simple virtual players",
    "wp4.2.action": "Development of prototypes of an adaptive game based on the emotional arousal and emotional state of the player",
    "wp4.2.result": "Educational adaptive video games-maze about Bulgarian medieval history",
    "wp4.3.action": "Educational adaptive video games-maze about Bulgarian medieval history",
    "wp4.3.result": "Educational video game-maze about Bulgarian medieval history with intelligent virtual players",
    "wp5.1.action": "Practical experiment with teachers and educators using the software platform for generating a non-adaptive video game-maze about Bulgarian medieval history",
    "wp5.1.result": "Dataset from game sessions and results from experiments with platform users",
    "wp5.2.action": "Initial practical experiment with students playing a non-adaptive game with simple virtual players",
    "wp5.2.result": "Dataset from game sessions and results from experiments with a non-adaptive game with simple virtual players",
    "wp5.3.action": "Second practical experiment with students playing an adaptive game (with adaptation based on emotional arousal and state) with simple virtual players",
    "wp5.3.result": "Data from game sessions and results from research with the adaptive game with simple virtual players",
    "wp5.4.action": "Final practical experiment with students playing a video game with intelligent virtual players",
    "wp5.4.result": "Game session data and results of the video game study with intelligent virtual players",
    "wp6.1.action": "Pre-processing of data from game sessions of practical experiments and their preparation for analysis",
    "wp6.1.result": "Dataset after pre-processing",
    "wp6.2.action": "Correlation and regression analysis of game session results",
    "wp6.2.result": "Results of correlation and regression analysis",
    "wp6.3.action": "Factor analysis of game session results",
    "wp6.3.result": "Results of factor analysis",
    "wp6.4.action": "Evaluation of the usability of the game platform",
    "wp6.4.result": "Results of the usability assessment of the game platform",
    "wp7.1.action": "Create and maintain a project website and leaflet ",
    "wp7.1.result": "Project website (with links to all other electronic resources) and leaflet",
    "wp7.2.action": "Create a detailed dissemination plan",
    "wp7.2.result": "Detailed dissemination plan",
    "wp7.3.action": "Scientific articles and presentations published in the proceedings of prestigious conferences",
    "wp7.3.result": "Minimum 8 articles published in prestigious international conferences",
    "wp7.4.action": "Articles in scientific journals",
    "wp7.4.result": "At least 3 articles submitted to scientific journals",
    "wp7.5.action": "Internal academic seminars and workshops",
    "wp7.5.result": "Minutes of workshops and seminars",
    "wp7.6.action": "Public engagement",
    "wp7.6.result": "APOGEE LinkedIn group, YouTube video channel, GitHub directory",
    "wp7.7.action": "Create an exploitation plan",
    "wp7.7.result": "Exploitation plan",
    "wp8.1.action": "Coordination and monitoring",
    "wp8.2.action": "Planning and risk and contingency analysis",
    "wp8.2.result": "Detailed project management plan",
    "wp8.3.action": "Coordination and monitoring and reporting to the funding organization and presentation of results",
    "wp8.3.result": "Interim and final reports",
    "wp8.4.action": "Resolution of conflicts",
    "team": "TEAM"
  },
  "resultsContent": {
    "journal_publications": "SCHOLARLY JOURNAL ARTICLES",
    "conference_publications": "CONFERENCE PAPERS",
    "patents": "PATENTS",
    "theses": "MASTER THESES",
    "dissertations": "PhD THESES",
    "presentations": "PRESENTATIONS",
    "videos": "VIDEO",
    "public_results": "PUBLIC RESULTS"
  },
  "newsContent": {
    "planning": "In the process of planning",
    "surveys": {
      "title": "ONLINE SURVEYS",
      "student_learning_styles": "Online Student Survey on Educational Video Games and Learning and Playing Styles",
      "student_game_usage": "Online survey for learners about the use of educational video games for learning (in Bulgarian)",
      "teacher_game_creation": "Online survey for teachers on the creation of educational video games by non-IT specialists and their use in training"
    },
    "seminars": {
      "title": "SEMINARS",
      "twinec_report": "Invited report at the scientific seminar \"TWineC: Thracians, Wine and Culture\", Shipka, February 21-23",
      "twinec_website": "Event website"
    },
    "conferences": {
      "title": "CONFERENCES WITH PRESENTATIONS OF MOTIVATE"
    },
    "events": {
      "title": "OTHER MOTIVATE EVENTS"
    }
  },
  "gamesContent": {
    "title": "GAMES",
    "howToPlay": {
        "label": "How to play (short guide)",
        "video": "video",
        "webpage": "Web page"
    },
    "asenevtsi": {
        "title": "Asenevtsi (version 0.8 - universal, and 0.86 - personalized)",
        "description1": "Asenevtsi is a demonstration educational game-maze on the medieval history of Bulgaria, generated with the platform for generating serious educational games APOGEE.",
        "description2": "The maze has six halls: 1. Introductory; 2. Uprising of Peter and Asen; 3. Tsar Kaloyan; 4. Tsar Ivan Asen II; 5. Bulgaria after Tsar Ivan Asen II; 6. Last hall. To reach the last hall, you must go through the other three, solving the mandatory game-tasks in the halls and then Answer the questions to unlock the doors. Solving the optional games brings additional points. The game ends after all the objects hidden in the halls are found. Explanations HOW TO PLAY you can see ",
        "controls1": "With the keys a, d, w and s you move left, right, forward and backward, and ",
        "controls2": "with Shift and these keys you move twice as fast.",
        "universalVersion": "To play the universal (shorter) version of the game, oriented to basic knowledge of the affairs of the Asenevtsi, click ",
        "personalizedVersion": "and to play the personalized (longer) version of the game, oriented to more in-depth knowledge of the Asenevtsi dynasty and the medieval history of Bulgaria, press ",
        "personalizationVersionExpl": " (you need to wait for the game to load in the browser, then click the button at the bottom right to play in full screen).",
        "tracking": "While playing, note (write down) how many minutes you played the game approximately, how many points you collected in total, how many points you earned in the QUIZ game in the last room, and how many hidden objects you found.",
        "evaluationSurvey": "When you finish the game, please fill out ",
        "survey1": "The game evaluation survey.",
        "evaluationSurvey2": ", in which you will also record the achieved results.",
        "comparisonSurvey": "If you have played both games, please fill out ",
        "survey2": "The comparison survey of the two games",
        "comparisonSurvey2": ", in which you will also record the achieved results in the games.",
        "thanks": "Thank you in advance for your time!"
    },
    "valchanVoyvoda": {
        "title": "The Legacy of Valchan Voyvoda (version 1.0)",
        "description1": "\"The Legacy of Valchan Voyvoda\" is a demonstration educational game-maze dedicated to the life and work of the legendary Valchan Voyvoda. The game was created under the project",
        "description2": "Heritage BG on the medieval history of Bulgaria",
        "description3": ", and was generated by the first prototype of the platform for generating serious educational games APOGEE.",
        "rooms": "The maze has 7 halls: 1. Introductory; 2. Epoch; 3. Who is Valchan Voyvoda; 4. Deeds; 5. Heritage; 6. Valchan Voyvoda today; 7. Treasure. To reach the last hall, you must go through all the others, solving the tasks in the halls and answering the questions to unlock the doors. Finding hidden objects earns points. The game ends when all the objects hidden in the rooms are found.",
        "playHere1": "Enter the game",
        "playHere2": " (you need to wait for the game to load from the server) and play one or more games!"
        },
        "footer": {
        "goodLuck": "Have fun and good luck!"
    }
 },
  "contactsContent": {
      "title": "Contacts",
      "project": {
          "label": "MOTIVATE Project",
          "email": "Email: games.motivate@gmail.com"
      },
      "leader": {
          "title": "MOTIVATE Project Manager",
          "name": "prof. Boyan Bontchev",
          "department": "Department of Software Technologies",
          "faculty": "Faculty of Mathematics and Informatics",
          "university": "Sofia University \"St. Cl. Ohridski\"",
          "address": {
              "street": "125 Tsarigradsko Shose Blvd",
              "block": "block 2, fl. 2, cab. 214A",
              "city": "Sofia 1113, Bulgaria"
          },
          "phone": "Phone: (+359) 2 971 04 00",
          "email": "Email: bbontchev@fmi.uni-sofia.bg",
          "skype": "Skype: bbontchev",
          "linkedin": "Linkedin: https://www.linkedin.com/in/bbontchev/"
      }
  }
}
