{
  "home": "НАЧАЛО",
  "about": "ЗА ПРОЕКТА",
  "goals": "Цели",
  "methodology": "Методология",
  "workpackages": "Работни пакети",
  "team": "Колектив",
  "results": "РЕЗУЛТАТИ",
  "publications": "Публикации",
  "presentations": "Презентации",
  "video": "Видео",
  "reported_results": "Отчетени резултати",
  "news": "НОВИНИ",
  "surveys": "Анкетни проучвания",
  "seminars": "Семинари",
  "conferences": "Конференции",
  "events": "Други събития",
  "games": "ИГРИ",
  "contact": "КОНТАКТ",
  "here":  "ТУК",
  "footerContent": {
    "system": "Система за управление на проекта.",
    "blog": "От блога",
    "project_presentation": "представяне на проекта и уебсайт",
    "last_modified": "Последна промяна на 15.02.2025",
    "contact": "Контакт",
    "phone": "Телефон:",
    "email": "Електронна поща:",
    "rights_reserved": "Всички права запазени"
 },
 "homeContent": {
    "title": "Моделиране на интелигентни инструменти за адаптивни и персонализирани образователни STEM видео игри (MOTIVATE)",
    "personalization": "Персонализиране",
    "personalization_desc": "Изграждане, генериране и персонализиране на образователни видеоигри.",
    "dynamic_adaptation": "Динамично адаптиране",
    "dynamic_adaptation_desc": "Динамично адаптиране на характеристиките на създадените образователни видеоигри.",
    "validation": "Валидиране",
    "validation_desc": "Валидиране на методологията и на платформата за създаване на интелигентни адаптивни видеоигри чрез практически експерименти.",
    "related_projects": "Свързани проекти",
    "goal_title": "Цели",
    "goal_desc": "Целта на проекта е да създаде методология и формални модели на интелигентни инструменти с използване на изкуствен интелект (ИИ) за създаване на адаптивни и персонализирани образователни видео игри и валидирането им в обучението по STEM дисциплини, с анализ на характеристиките на игровия процес и успеваемостта на обучаемия, чрез надграждане на съществуваща отворена софтуерна платформа за видео игри за обучение. Изградените в рамките на проекта методология и технологично решение (интелигентни софтуерни инструменти) за създаване и използване на адаптивни и персонализирани сериозни видео игри ще бъдат валидирани и оценени посредством практически експерименти със студенти по педагогика, учители в средните училища и университетски преподаватели. Валидирането ще включва създаване на образователни видео игри в областта на STEM дисциплините – както компютърни, така и мобилни игри с добавена реалност.",
    "funding": "Проект MOTIVATE се финансира от Фонд „Научни изследвания“ на МОН по Договор № КП06-Н85-2 от 05.12.2024г.",
    "learn_more": "Научи повече за проекта",
    "surveys": "Анкетни проучвания",
    "survey_1": "Онлайн анкета за учащи относно образователни видео игри и стилове на учене и на играене",
    "survey_2": "Онлайн анкета за учащи относно използването на образователни видео игри в обучението",
    "survey_3": "Онлайн анкета за учители относно създаването на образователни видео игри от не-ИТ специалисти и използването им в обучението"
  },
  "goalsContent": {
    "title": "Основни цели на проекта",
    "title1": "Цел 1",
    "description1": "Да се идентифицират формалните начини за декларативно описание на сценариите на образователни игри, използващи семантично-структурирано съдържание;",
    "title2": "Цел 2",
    "description2": "Да се създаде софтуерна платформа за изграждане и генериране на интелигентни адаптивни игри чрез 3D видео лабиринт, състояща се от редактор на лабиринта, управляван от метаданни, строител на лабиринта на базата на Unity3D, използващ инструмент за управление на адаптацията, интелигентен агент за въпроси и отговори, и декларативно семантично структурирано описание на играта;",
    "title3": "Цел 3",
    "description3": "Да се приложи платформата за генериране на прототипи на видеоигри за средновековната история на България, използвайки самостоятелно създадени 3D графични модели и съдържание на игри, активни сценарии за обучение, базирано на игри (ОБИ) и дидактически задачи, както с обикновени, така и с интелигентни виртуални играчи, които подпомагат реалния играч при решаването на задачите;",
    "title4": "Цел 4",
    "description4": "Да се приложи насочения към играча холистичен модел от проекта ADAPTIMES за осъществяване на адаптивни версии на онлайн видеоигрите на базата на постиженията, възбудата и емоциите на играча, чрез анализ на кожна проводимост и лицеви изражения;",
    "title5": "Цел 5",
    "description5": "Да се валидират както не-адаптивните, така и адаптивните версии на видеоигрите чрез практически онлайн експерименти с преподаватели и ученици. Експерименталните проучвания ще използват натрупания голям опит в проекти за опазване на културното наследство и електронното обучение;",
    "title6": "Цел 6",
    "description6": "Да се анализират експерименталните резултати и очакваните ползи от прилагането на платформата от преподавателите, практикуващи ОБИ, и от адаптивния начин на игра по отношение на по-добрите игрови възможности и резултати от обучението."
 },
 "methodologyContent": {
    "title": "МЕТОДОЛОГИЯ",
    "intro": "Изследователската методология на MOTIVATE ще следва итеративен и инкрементален подход, разширяващ с метода „учене чрез практика“ методологията, дефинирана от Kirjavainen. Използването на мултидисциплинарен модел за разработка, предполагащ итеративен и инкрементален подход и използване на гъвкави техники като методологията за контрол на процеса на SCRUM е най-подходящ за проекта особено за генерирането на игрова концепция, дизайн на играта и имплементация. Избраната методология обхваща всички етапи от процеса на научноизследователска и развойна дейност на проекта, комбинирана е с метода „учене чрез практика“ и се състои от следните фази:",
    "phase1": "Идентифициране на изследователски проблеми и формулиране на изследователски въпроси и задачи. Тук прилагането на метода „учене чрез практика“ цели увеличаване на обмена на идеи за научни и технологични решения между различни по области на компетентност специалисти като експерти по културно наследство, дизайнери на игри, разработчици на платформи и игри и обучители практикуващи учене чрез игри. Цели на фазата: адекватно и точно описание на контекста на изследването (проблематика и задачи при формалното описание на игри и организацията на семантичното съдържание, генериране на видеоигри, сценарии за игри / дидактични методи / задачи за адаптивни игри) и подробна научна формулировка - изследователски въпроси и задачи, нужди на целевите потребители на платформата (учители и педагози) и на образователните видеоигри, конструирани чрез платформата (5-8 ученици от клас).",
    "phase2": "Отговаряне на изследователските въпроси – ще бъде осъществено, чрез теоретични изследвания и практическа работа с прилагането на метода „учене чрез практика“.",
    "phase2_goals": "Цели на фазата:",
    "pashe2.1": "Дефиниране на формален език за описание на йерархични лабиринти, включително семантично структурирано учебно съдържание",
    "phase2.2": "Проектиране и разработване на иновативна софтуерна платформа, базирана на съществуваща машина за управление на игри (като Unity 3D), и използвана за генериране на персонализирани йерархични 3D видео игри-лабиринти с прости и интелигентни виртуални играчи, при които конструкцията се основава на декларативно описание на играта и семантично структурирани културни артефакти, изградени с помощта на базиран на метаданни визуален редактор на лабиринт",
    "phase3": "Практическа проверка на отговорите на изследователските въпроси. Цели на фазата: внедряване на софтуерни прототипи на видеоигри, ориентирани към играчите, конструирани от платформата за генериране от предишния етап. Итеративният и гъвкав (базиран на SCRUM) процес, свързан с риска, ще се състои от две итерации на доказателство на концепцията, а именно:",
    "phase3.1": "Разработване на не-адаптивни прототипи на настолни и онлайн видеоигри за българската средновековна история, с прости виртуални играчи - включващи проактивни сценарии на игри, задачи и 3D съдържание. Подходът, базиран на играта, използва съвременни учебни парадигми, като развива серия от взаимосвързани дейности, в които обучаемите не само са активни участници, но и имат свободата да избират свой собствен път на учене в играта.",
    "phase3.2": "Разработване на адаптивни прототипи на интелигентни адаптивни видеоигри за обучение в областта на историята и въпросници за онлайн анкети. Всички експерименти ще се провеждат онлайн с цел да бъдат използвани показателите за емоционалното състояние на играча базирани на EDA и BVP динамично измервани от специално устройство и игровия компонент на RAGE , който измерва степента на емоционалната възбуда на играча, както и софтуерни библиотеки като Affdex SDK за разпознаване на емоции.",
    "phase4": "Практически експерименти с целевите групи - включва тестване на прототипите на игри в избраната област в реални условия с онлайн настройка, включваща формуляр за съгласие и информационни листове, интелигентни адаптивни видеоигри за обучение по история с прости и интелигентни виртуални играчи и въпросници за онлайн анкети. Всички експерименти ще се провеждат онлайн, за да се включат повече участници и съответно получаване на статистически значими резултати. Цели на фазата: определяне и изпълнение на онлайн експериментални проучвания, включително игрови сесии с не-адаптивни и адаптивни версии на игрите и анкети преди и след игра, съдържащи въпроси относно предишен опит в игрите , ангажираност и опит с игри, както и такива относно използваемостта на платформата за генериране.",
    "phase5": "Анализи и валидиране на резултатите от проучването. Цели на фазата: анализ и валидиране на експерименталните резултати и тяхното влияние върху прототипите на крайните игри посредством дисперсионен анализ (ANOVA), корелационен анализ и анализ на главните компоненти и/или факторен анализ - всички използвани за валидиране (1) използваемостта на платформата за конструиране на игри от целевата потребителска група (учители и педагози), (2) анализ на адаптивното и подпомогнатото от агенти обучение с игри за ученици, заедно с (3) очаквани иновационни подобрения в играта, водещо до насоки за бъдещи изследвания."
  },
  "workpackagesContent": {
    "title": "РАБОТНИ ПАКЕТИ",
    "wp": "Работен пакет",
    "action": "Дейност",
    "expected_result": "Очакван резултат",
    "wp1.1.action": "Сравнителни анализи в областите на адаптивни видеоигри, ориентирани към играча, съвременна употреба на интелигентни агенти, платформи за създаване на видео игри и методи и техники в обучението базирано на игри.",
    "wp1.1.result": "Анализ в областите на адаптивните видеоигри, ориентирани към играча с интелигентни агенти за образователни цели и платформите за конструиране на игри и приложения за обучение базирано на игри",
    "wp1.2.action": "Идентифициране на потребностите на целевите потребители на образователни видеоигри (учители и ученици)",
    "wp1.2.result": "Анализ на потребностите на целевите потребители на образователни видеоигри",
    "wp1.3.action": "Идентифициране на потребностите на целевите потребители на платформи за изграждане на образователни видеоигри (учители и педагози)",
    "wp1.3.result": "Анализ на нуждите на целевите потребители на платформи за изграждане на образователни видеоигри",
    "wp2.1.action": "Декларативно моделиране на образователни игри-лабиринти със семантично структуриране на игрово и учебно съдържание",
    "wp2.1.result": "Декларативен модел на образователни игри-лабиринти със семантично структуриране на игрово и учебно съдържание",
    "wp2.2.action": "Моделиране на игрови процес и взаимодействие на играчите (включително и на виртуалните) във видеоигри за образование с един и много играчи",
    "wp2.2.result": "Модел на игрови процес и взаимодействие на играчите във видеоигри за образование",
    "wp2.3.action": "Създаване на проактивни сценарии за игрово обучение и дидактически задачи",
    "wp2.3.result": "Проактивни сценарии за игрово обучение и дидактически задачи",
    "wp3.1.action": "Създаване на платформа за конструиране на видео игра, автоматично генерираща лабиринти",
    "wp3.1.result": "Платформа за конструиране на видео игра, автоматично генерираща лабиринти",
    "wp3.2.action": "Създаване редактор на лабиринт, базиран на метаданни с вграден графичен редактор на граф и валидатор",
    "wp3.2.result": "Редактор на лабиринт, базиран на метаданни с вграден графичен редактор на граф и валидатор",
    "wp3.3.action": "Създаване на интелигентен агент за отговаряне на въпроси въз основа на извличане на факти от съдържанието на домейна",
    "wp3.3.result": "Виртуални играчи и интелигентен агент за отговаряне на въпроси",
    "wp4.1.action": "Разработване на игровото съдържанието, дизайна на играта и генериране",
    "wp4.1.result": "Образователна неадаптивна видео игра-лабиринт за българската средновековна история с прости виртуални играчи",
    "wp4.2.action": "Разработване на прототипи на адаптивна игра базирана на емоционалната възбуда и емоционалното състояние на играча",
    "wp4.2.result": "Образователни адаптивни видео игри-лабиринти за българската средновековна история",
    "wp4.3.action": "Образователни адаптивни видео игри-лабиринти за българската средновековна история",
    "wp4.3.result": "Образователна видео игра-лабиринт за българската средновековна история с интелигентни виртуални играчи",
    "wp5.1.action": "Практически експеримент с учители и педагози използващи софтуерната платформа за генериране на неадаптивна видео игра-лабиринт за българската средновековна история",
    "wp5.1.result": "Набор от данни от сесиите на игри и резултати от експерименти с потребители на платформата",
    "wp5.2.action": "Първоначален практически експеримент с ученици, играещи неадаптивна игра с прости виртуални играчи",
    "wp5.2.result": "Набор от данни от сесиите на игри и резултати от експерименти с неадаптивна игра с прости виртуални играчи",
    "wp5.3.action": "Втори практически експеримент с ученици, играещи адаптивна игра (с адаптация въз основа на емоционалната възбуда и състояние) с прости виртуални играчи",
    "wp5.3.result": "Данни от сесиите на игри и резултати от изследванията с адаптивната игра с прости виртуални играчи",
    "wp5.4.action": "Последен практически експеримент с ученици, играещи видео игра с интелигентни виртуални играчи",
    "wp5.4.result": "Данни от сесиите на игрите и резултати от проучването с видео игри с интелигентни виртуални играчи",
    "wp6.1.action": "Предварителна обработка на данните от игровите сесии на практическите експеримент и подготовката им за анализ",
    "wp6.1.result": "Набор с данни след предварителна обработка",
    "wp6.2.action": "Корелационен и регресионен анализ на резултатите от игровата сесия",
    "wp6.2.result": "Резултати от корелационния и регресионния анализ",
    "wp6.3.action": "Факторен анализ на резултатите от игровата сесия",
    "wp6.3.result": "Резултати от факторния анализ",
    "wp6.4.action": "Оценката на използваемостта на платформата за игра",
    "wp6.4.result": "Резултати от оценката на използваемостта на платформата за игра",
    "wp7.1.action": "Създаване и поддръжка на Уеб сайт на проекта и брошура",
    "wp7.1.result": "Уеб сайт на проекта (с връзка към всички други електронни ресурси) и брошура",
    "wp7.2.action": "Създаване на подробен план за разпространение",
    "wp7.2.result": "Подробен план за разпространение",
    "wp7.3.action": "Научни статии и презентации публикувани в изданията на престижни конференции",
    "wp7.3.result": "Минимум 8 статии публикувани на престижни международни конференции",
    "wp7.4.action": "Статии в научни списания",
    "wp7.4.result": "Поне 3 статии, изпратени до научни списания",
    "wp7.5.action": "Вътрешни академични семинари и работни срещи",
    "wp7.5.result": "Протоколи от работните срещи и семинари",
    "wp7.6.action": "Обществена ангажираност",
    "wp7.6.result": "Група APOGEE в LinkedIn, видео канал в YouTube, директория в GitHub",
    "wp7.7.action": "Създаване на план за експлоатация",
    "wp7.7.result": "План за експлоатация",
    "wp8.1.action": "Координация и мониторинг",
    "wp8.2.action": "Планиране, анализ на риска и непредвидени ситуации",
    "wp8.2.result": "Подробен план за управление на проекта",
    "wp8.3.action": "Координация и наблюдение и докладване пред финансиращата организация и представяне на резултатите",
    "wp8.3.result": "Междинни и крайни доклади",
    "wp8.4.action": "Разрешаване на конфликти",
    "team": "КОЛЕКТИВ"
  },
  "resultsContent": {
    "journal_publications": "ПУБЛИКАЦИИ В СПИСАНИЯ",
    "conference_publications": "ПУБЛИКАЦИИ В СБОРНИЦИ НА КОНФЕРЕНЦИИ",
    "patents": "ПАТЕНТИ",
    "theses": "ДИПЛОМНИ РАБОТИ",
    "dissertations": "ДИСЕРТАЦИИ",
    "presentations": "ПРЕЗЕНТАЦИИ",
    "videos": "ВИДЕОЗАПИСИ",
    "public_results": "ПУБЛИЧНИ РЕЗУЛТАТИ"
  },
  "newsContent": {
    "planning": "В процес на планиране",
    "surveys": {
      "title": "АНКЕТНИ ПРОУЧВАНИЯ",
      "student_learning_styles": "Онлайн анкета за учащи относно образователни видео игри и стилове на учене и на играене",
      "student_game_usage": "Онлайн анкета за учащи относно използването на образователни видео игри в обучението",
      "teacher_game_creation": "Онлайн анкета за учители относно създаването на образователни видео игри от не-ИТ специалисти и използването им в обучението"
    },
    "seminars": {
      "title": "СЕМИНАРИ",
      "twinec_report": "Доклад по покана на научен семинар \"TWineC: Траки, вино и култура\", гр. Шипка, 21-23 февруари",
      "twinec_website": "Уеб сайт на събитието"
    },
    "conferences": {
      "title": "КОНФЕРЕНЦИИ С ПРЕДСТАВЯНЕ НА MOTIVATE"
    },
    "events": {
      "title": "ДРУГИ СЪБИТИЯ С MOTIVATE"
    }
  },
  "gamesContent": {
    "title": "ИГРИ",
    "howToPlay": {
      "label": "Как да играем (кратко ръководство)",
      "video": "видео",
      "webpage": "Уеб страница"
    },
    "asenevtsi": {
      "title": "Асеневци (версия 0.8 - универсална, и 0.86 - персонализирана)",
      "description1": "Асеневци е демонстрационна учебна игра-лабиринт по средновековна история на България, генерирана с платформата за генериране на сериозни игри за обучение APOGEE.",
      "description2": "Лабиринтът има шест зали: 1. Въвеждаща; 2. Въстание на Петър и Асен; 3. Цар Калоян; 4. Цар Иван Асен II; 5. България след цар Иван Асен II; 6. Последна зала. За да се стигне до последната зала, трябва да се премине през останалите три, като се решат задължителните игри-задачи в залите и след това се отговори на въпросите за отключване на вратите. Решаването на незадължителните игри носи допълнителни точки. Играта приключва, след като се открият всички скрити в залите предмети. Обяснения КАК ДА ИГРАЕМ можете да видите ",
      "controls1": "С клавишите a, d, w и s се придвижвате вляво, вдясно, напред и назад, а ",
      "controls2": "с Shift и тези клавиши се придвижвате два пъти по-бързо.",
      "universalVersion": "За да изиграете универсалната (по-кратка) версия на играта, ориентирана към основни познания за делата на Асеневци, щракнете ",
      "personalizedVersion": "а за да изиграете персонализираната (по-дълга) версия на играта, ориентирана към по-задълбочени познания за династията на Асеневци и средновековната история на България, натиснете ",
      "personalizationVersionExpl": " (необходимо е да изчакате зареждането на играта в браузъра, след което щракнете на бутона долу вдясно за играене на цял екран).",
      "tracking": "Докато играете, обърнете внимание (запишете си) колко минути приблизително сте играли играта, колко точки общо сте събрали, колко точки спечелихте в играта ВИКТОРИНА в последната зала и колко скрити предмети сте намерили.",
      "evaluationSurvey": "Като приключите играта, моля попълнете ",
      "survey1": "Анкетата за оценяване на играта.",
      "evaluationSurvey2": ", в която ще запишете и постигнатите резултати.",
      "comparisonSurvey": "Ако сте изиграли и двете игри, моля попълнете ",
      "survey2": "Анкетата за сравняване на двете игри",
      "comparisonSurvey2": ", в която ще запишете и постигнатите резултати в игрите.",
      "thanks": "Предварително Ви благодарим за отделеното време!"
    },
    "valchanVoyvoda": {
      "title": "Наследството на Вълчан Войвода (версия 1.0)",
      "description1": "\"Наследството на Вълчан Войвода\" е демонстрационна учебна игра-лабиринт, посветена на  живота и делото на легендарния Вълчан Войвода. Играта е създадена по проект",
      "description2": "Наследство БГ по средновековна история на България",
      "description3": ", като е генерирана от първия прототип платформата за генериране на сериозни игри за обучение APOGEE.",
      "rooms": "Лабиринтът има 7 зали: 1. Въвеждаща; 2. Епоха; 3. Кой е Вълчан Войвода; 4. Дела; 5. Наследстро; 6. Вълчан Войвода днес; 7. Съкровище. За да се стигне до последната зала, трябва да се премине през всички останали, като се решат задачите в залите и се отговори на въпросите за отключване на вратите. Откриването на скрити предмети носи точки. Играта приключва, след като се открият всички скрити в залите предмети.",
      "playHere1": "Влезте в играта",
      "playHere2": " (необходимо е да изчакате зареждането на играта от сървъра) и изиграйте една или повече игри!"
    },
    "footer": {
      "goodLuck": "Приятна игра и успех!"
    }
  },
  "contactsContent": {
    "title": "Контакти",
    "project": {
      "label": "Проект MOTIVATE",
      "email": "Електронна поща: games.motivate@gmail.com"
    },
    "leader": {
      "title": "Ръководител на проект MOTIVATE",
      "name": "проф. Боян Бончев",
      "department": "катедра Софтуерни технологии",
      "faculty": "Факултет по математика и информатика",
      "university": "Софийски университет \"Св. Кл. Охридски\"",
      "address": {
        "street": "бул. \"Цариградско шосе\" 125",
        "block": "блок 2, ет. 2, каб. 214А",
        "city": "София 1113, България"
      },
      "phone": "Телефон: (+359) 2 971 04 00",
      "email": "Електронна поща: bbontchev@fmi.uni-sofia.bg",
      "skype": "Скайп: bbontchev",
      "linkedin": "Линкедин: https://www.linkedin.com/in/bbontchev/"
    }
  }
}
